{"docs/1-ingesta-almacenamiento":{"slug":"docs/1-ingesta-almacenamiento","filePath":"docs/1-ingesta-almacenamiento.md","title":"1. Ingesta y Almacenamiento","links":[],"tags":[],"content":"Contexto del Proyecto\nEl objetivo de este proyecto es construir un pipeline de datos que procese las encuestas mensuales recibidas en formato Excel (*.xlsx).\nA través de este flujo, los datos crudos se limpian, validan y transforman en información útil para el análisis posterior.\nDe esta forma, se asegura que las métricas de satisfacción reflejen datos fiables y trazables, garantizando la calidad del análisis mensual.\n\nProceso de Ingesta\nEl proceso de ingesta comienza con la recopilación y normalización de los archivos Excel que contienen las encuestas.\n\n\nOrigen de los Datos\n\nLos datos de entrada se encuentran en la carpeta project/output/xlsx/.\nCada archivo (encuestas_YYYYMM.xlsx) representa un lote mensual de respuestas recogidas.\nEstos ficheros contienen información sobre:\n\nfecha de la encuesta\nid_respuesta\ncanal (por ejemplo, online o tienda)\nproducto\nsatisfacción (valor del 1 al 10)\ncomentario, tienda y agente\n\n\n\n\n\nLectura y Normalización\nDurante esta fase, el sistema:\n\nLee cada Excel mediante la función read_xlsx_exports() (archivo ingest.py).\nEstandariza los nombres de las columnas a minúsculas y elimina espacios en blanco.\nAsegura la existencia de las columnas mínimas necesarias (fecha, id_respuesta, satisfaccion, etc.).\nAñade tres columnas de trazabilidad:\n_source_file   → nombre del archivo original  \n_ingest_ts     → fecha y hora exactas en que se procesó el archivo  \n_batch_id      → identificador del lote (por ejemplo, &quot;encuestas_202511&quot;)\n\n\n\n\nAlmacenamiento Inicial (Capa Raw)\nUna vez procesadas las encuestas, se almacenan en una base de datos SQLite (project/encuestas.db), dentro de la tabla raw_encuestas.\nEste paso garantiza que todos los datos originales queden respaldados y disponibles para futuras revisiones o reprocesos.\nAdemás, también se genera una copia en formato Parquet (clean_encuestas.parquet) dentro de project/output/xlsx/, lo que facilita su uso en herramientas analíticas.\n\n\n\nEjemplo de Flujo\ndata/drops/encuestas_2025_large.csv\n       ↓\nxlsx_export.py  →  genera Excel limpio (Encuestas + ResumenCalidad)\n       ↓\ningest.py       →  lee los Excels y los combina en un solo DataFrame\n       ↓\nstore.py        →  guarda los datos en SQLite (raw_encuestas)\n       ↓\nclean.py        →  limpia y valida los registros"},"docs/2-limpieza-calidad":{"slug":"docs/2-limpieza-calidad","filePath":"docs/2-limpieza-calidad.md","title":"2. Limpieza y Control de Calidad","links":[],"tags":[],"content":"Contexto de la Fase\nUna vez que los datos de encuestas han sido ingeridos y almacenados correctamente, el siguiente paso del pipeline consiste en limpiar y validar la información.\nEl objetivo de esta fase es asegurar que los registros sean coherentes, completos y útiles para los análisis posteriores.\nEsto implica detectar errores comunes (fechas inválidas, puntuaciones fuera de rango, identificadores vacíos, etc.) y aislar esos casos en una zona de cuarentena para no alterar los resultados finales.\n\n1. Proceso de Limpieza\nLa limpieza se realiza mediante la función clean_data() ubicada en el archivo clean.py.\nEste proceso trabaja sobre los datos almacenados en la tabla raw_encuestas y genera dos salidas principales:\n\nclean → datos válidos y listos para el análisis.\nquarantine → registros con errores o inconsistencias.\n\nPasos principales:\n\n\nNormalización de Nombres y Textos\n\nConvierte todos los nombres de columnas a minúsculas.\nElimina espacios innecesarios en los textos.\nHomogeneiza los valores para evitar duplicidades por diferencias de formato (por ejemplo, ” Online” y “online” se tratan igual).\n\n\n\nConversión de Tipos de Datos\n\nLa columna fecha se transforma en formato fecha estándar (datetime).\nLa columna satisfaccion se convierte en valor numérico (1 a 10).\nValores como &quot;no sabe/no contesta&quot; o &quot;ns/nc&quot; se transforman en NaN (vacíos), para poder calcular correctamente los promedios.\n\n\n\nDetección de Duplicados\n\nSi una misma respuesta (id_respuesta) aparece varias veces, se conserva solo la más reciente, siguiendo la política “último gana”.\nEsta decisión se basa en el campo _ingest_ts (marca temporal del momento en que se cargó el dato).\n\n\n\nValidación de Calidad\nSe aplican reglas automáticas para detectar registros inválidos:\n\nfecha_invalida: cuando la fecha está vacía o no puede convertirse.\nsatisf_fuera_rango: cuando la satisfacción no está entre 1 y 10.\nid_respuesta_vacio: cuando el identificador está en blanco o ausente.\n\nLos registros que incumplen alguna de estas reglas se envían a la cuarentena con una explicación de la causa.\n\n\n\n2. Estructura del Resultado\nAl finalizar el proceso, el pipeline devuelve dos conjuntos de datos:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSalidaDescripciónEjemplo de usocleanEncuestas limpias y válidasUsadas para calcular medias, distribuciones, KPIs, etc.quarantineRespuestas con errores o valores no válidosGuardadas para revisión manual o trazabilidad.\nEn la tabla quarantine, los motivos se guardan en la columna _quarantine_reason, por ejemplo:\nfecha_invalida\nsatisf_fuera_rango\nfecha_invalida;satisf_fuera_rango"},"docs/3-modelo-reporte":{"slug":"docs/3-modelo-reporte","filePath":"docs/3-modelo-reporte.md","title":"3. Modelado y Generación de Reportes","links":[],"tags":[],"content":"Contexto\nUna vez completada la fase de limpieza, los datos de encuestas ya son fiables y coherentes.\nEl siguiente paso del pipeline consiste en modelarlos y resumirlos en un formato comprensible para el análisis mensual.\nEl objetivo principal de esta etapa es transformar los datos limpios en información útil, calculando métricas clave (KPIs) y generando un reporte en formato Markdown que sintetiza los resultados del periodo.\n\n1. Modelado: Transformar Datos Limpios en Métricas\nEl modelado se realiza en el archivo report.py, a través de la función generate_report().\nAquí se agrupan y analizan los datos limpios (clean_encuestas) para obtener indicadores relevantes:\nKPIs calculados\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMétricaDescripciónEjemploEncuestas (clean)Número total de registros válidos tras la limpieza.1.838NS/NCRespuestas sin valoración (nulos o “no sabe/no contesta”).227 (12.4%)Media de satisfacciónPromedio aritmético de las puntuaciones de satisfacción (1–10).5.41Evolución mensualCantidad y media de satisfacción por mes.Enero: 5.43 — Febrero: 5.70\nEstos valores se calculan agrupando la columna satisfaccion y ordenando las fechas por mes.\n\n2. Estructura del Reporte\nEl reporte se genera automáticamente en formato Markdown (reporte.md) dentro de la carpeta project/output/.\nContiene cuatro secciones principales:\n🧾 1. Contexto\nInformación básica sobre los datos procesados:\n\nFuente (encuestas_YYYYMM.xlsx)\nPeriodo cubierto (mínimo y máximo de fechas)\nMecanismo de trazabilidad (_ingest_ts, _source_file, _batch_id)\n\n📊 2. KPIs\nResumen con las métricas más importantes (totales, medias y porcentajes).\n📈 3. Tablas de Resultados\nIncluye:\n\nDistribución de satisfacción (de 1 a 10 + NS/NC)\nEvolución mensual de la media de satisfacción y número de encuestas\n\nEjemplo:\n## Distribución de satisfacción (1–10 + NS/NC)\n| satisf_str | n |\n|-------------|---|\n| 1 | 167 |\n| 2 | 171 |\n| 3 | 180 |\n| ... | ... |\n| 10 | 149 |\n| NS/NC | 227 |"},"index":{"slug":"index","filePath":"index.md","title":"Pipeline de Encuestas","links":["docs/1-ingesta-almacenamiento","docs/2-limpieza-calidad","docs/3-modelo-reporte","reportes/reporte-encuestas"],"tags":[],"content":"Pipeline de Encuestas\nBienvenido 👋\nEste sitio documenta el desarrollo y funcionamiento del pipeline de encuestas, un sistema automatizado que transforma archivos de datos brutos en reportes analíticos listos para su revisión.\nEl objetivo principal es procesar encuestas de satisfacción, garantizando calidad, trazabilidad y generación automática de informes.\n\n🧭 Estructura de la documentación\n📂 1. Ingesta y Almacenamiento\nExplica cómo se cargan los archivos fuente (CSV o Excel), cómo se detecta el separador automáticamente, se validan las columnas y se genera un Excel con metadatos y un resumen de calidad.\nAdemás, detalla la trazabilidad (source_file, ingest_ts, batch_id) y el almacenamiento en base de datos SQLite y formato Parquet.\n👉 Ver sección → Ingesta y Almacenamiento\n\n🧹 2. Limpieza y Control de Calidad\nDescribe cómo se normalizan los textos, se corrigen los valores, y se aplican reglas de validación (fechas, rangos de satisfacción, IDs válidos).\nLos registros que no cumplen las reglas se mueven automáticamente a una tabla de cuarentena, preservando el motivo de su exclusión.\n👉 Ver sección → Limpieza y Control de Calidad\n\n📊 3. Modelado y Generación de Reportes\nDetalla el proceso de análisis y generación de KPIs, con cálculos de medias, porcentajes y evolución temporal.\nIncluye la exportación a Excel (informe de calidad) y Markdown (reporte de resultados).\n👉 Ver sección → Modelado y Generación de Reportes\n\n📈 Reporte Final\nVisualiza el informe final de encuestas generado automáticamente a partir del pipeline.\nIncluye métricas clave, distribución de satisfacción, evolución mensual y control de calidad de los datos.\n👉 Ver reporte → Reporte UT1 · Encuestas de Satisfacción\n\n🧩 Tecnologías utilizadas\n\nPython + Pandas → lectura, limpieza y análisis de datos.\nSQLite + Parquet → persistencia eficiente.\nOpenPyXL → generación de informes Excel con formato automático.\nQuartz → documentación web del proyecto.\n\n\n🧠 Autores y créditos\nProyecto académico desarrollado por\nLeandro Pérez Martínez — módulo Big Data Aplicado / UT1 – RA1 (FCT)\nCIFP Carlos III, Cartagena (Murcia).\n\n✳️ Última actualización: 9 de noviembre de 2025."},"reportes/reporte-encuestas":{"slug":"reportes/reporte-encuestas","filePath":"reportes/reporte-encuestas.md","title":"Reporte UT1 · Encuestas de Satisfacción","links":[],"tags":[],"content":"Informe de Encuestas (resumen mensual)\nEste documento presenta un resumen claro y comprensible de los resultados obtenidos tras el procesamiento de las encuestas.\nIncluye indicadores clave (KPIs), evolución temporal y control de calidad de los datos.\n\n1. Datos generales\nPeriodo analizado: 2025-01-11 — 2025-12-12\nRegistros procesados (totales): 5000\nRegistros válidos (clean): 1838\nRegistros en cuarentena: 3162\n\nLos datos válidos (clean) cumplen con las reglas de calidad definidas (fechas válidas, satisfacción 1–10, id_respuesta presente).\nLos registros en cuarentena no superan dichas reglas y se almacenan con su motivo de rechazo.\n\n\n2. Resumen rápido\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIndicadorValorEncuestas válidas (clean)1838Respuestas NS/NC (sin valor)227% NS/NC sobre Clean12.4%Media de satisfacción (1–10)5.41\n\n3. Interpretación de indicadores\n\nEncuestas válidas (clean): respuestas que pasan las reglas básicas de calidad.\nNS/NC: respuestas sin puntuación de satisfacción (por ejemplo, “no sabe / no contesta”).\n% NS/NC: porcentaje de NS/NC respecto al total de respuestas válidas.\nMedia de satisfacción: valor medio de las puntuaciones (1 = muy mala, 10 = muy buena).\n\n\n4. Distribución de satisfacción (1–10 + NS/NC)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nvalorn11672171318041535156613671848169915310149NS/NC227\n\nMuestra la distribución general de las puntuaciones, permitiendo detectar tendencias o sesgos.\n\n\n5. Evolución mensual\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nmesencuestasmedia_satisf2025-01-01 00:00:001955.432025-02-01 00:00:001485.72025-03-01 00:00:001495.482025-04-01 00:00:001555.132025-05-01 00:00:001455.572025-06-01 00:00:001345.452025-07-01 00:00:001395.062025-08-01 00:00:001485.372025-09-01 00:00:001855.382025-10-01 00:00:001855.372025-11-01 00:00:001835.352025-12-01 00:00:001555.35\n\nPermite observar la estabilidad mensual de la media de satisfacción.\nSe aprecia una media relativamente constante con ligeras variaciones entre 5.3 y 5.7.\n\n\n6. Calidad de los datos (cuarentena)\nLos registros que no cumplen las reglas de calidad se guardan aparte con su motivo específico:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncausanfecha_invalida2906fecha_invalida;satisf_fuera_rango165satisf_fuera_rango91\n\n\nfecha_invalida: error o ausencia en la fecha.\nsatisf_fuera_rango: puntuación fuera del rango permitido (1–10).\nCombinadas: varios errores en la misma fila.\n\nEstas filas se almacenan en la tabla quarantine_encuestas para auditoría y depuración futura.\n\n\n7. Conclusiones generales\n\nLa satisfacción media se mantiene estable a lo largo del año (5.4/10).\nEl porcentaje de NS/NC es moderado (12.4%), lo que sugiere una calidad de respuesta aceptable.\nLa mayoría de las incidencias en cuarentena se deben a fechas inválidas, indicando posibles errores de formato o exportación.\nRecomendación: reforzar la validación previa de fechas y fomentar la respuesta completa en las encuestas.\n\n\n8. Persistencia y trazabilidad\n\nSQLite (project/encuestas.db):\n\nraw_encuestas: datos originales.\nclean_encuestas: datos limpios.\nquarantine_encuestas: registros rechazados.\n\n\nExcel (project/output/informe_de_calidad.xlsx): resumen de nulos y causas de cuarentena.\nMarkdown (project/output/reporte.md): este informe.\n\n\nCada registro contiene campos de trazabilidad: _source_file, _ingest_ts, _batch_id.\n\n"}}